#include "HAL_IWDT.h"
#include "TX32F01.h"

/********************************************************************************************************
**函数信息 ：IWDT_Init(uint8_t Prescaler,uint16_t ReloadValue)
**功能描述 ：IWDT初始化
**输入参数 ：Prescaler：IWDT分配系数（注意LRC=32KHz）
						ReloadValue：IWDT计数器重装载值
**输出参数 ：无
********************************************************************************************************/
void IWDT_Init(uint8_t Prescaler,uint16_t ReloadValue)
{
    IWDT->KR = 0x5555;//去除写保护
    IWDT->PR = Prescaler;//配置分频系数
    IWDT->RLR = ReloadValue;//设置重装载值
}

/********************************************************************************************************
**函数信息 ：IWDT_CmdEnable(void)
**功能描述 ：开启IWDT，注意IWDT一旦开启则无法关闭，除非芯片发生复位
**输入参数 ：无
**输出参数 ：无
********************************************************************************************************/
void IWDT_CmdEnable(void)
{
    IWDT->KR = 0xCCCC;//启动看门狗
    IWDT->KR = 0xAAAA;//喂狗
    IWDT->KR = 0xAAAA;//喂狗
}

/********************************************************************************************************
**函数信息 ：IWDT_ITConfig(FunctionalState NewState)
**功能描述 ：IWDT中断使能
**输入参数 ：无
**输出参数 ：无
********************************************************************************************************/
void IWDT_ITConfig(FunctionalState NewState)
{
    if (NewState != DISABLE)
    {
        IWDT->IER = 1;//开启中断
    }
    else
    {
        IWDT->IER =  0;//关闭中断
    }
}

/********************************************************************************************************
**函数信息 ：IWDT_GetFlagStatus(void)
**功能描述 ：得到标志位状态
**输入参数 ：无
**输出参数 ：无
********************************************************************************************************/
BOOL IWDT_GetFlagStatus(void)
{
    if (IWDT->IFR)
    {
        return  TRUE;
    }
    else
    {
        return  FALSE;
    }
}

/********************************************************************************************************
**函数信息 ：IWDT_ClearFlag(void)
**功能描述 ：清除标志位状态
**输入参数 ：无
**输出参数 ：无
********************************************************************************************************/
void IWDT_ClearFlag(void)
{   
    IWDT->IFR&=~1;//清除标志位
}

/********************************************************************************************************
**函数信息 ：IWDT_ReloadCounter(void)
**功能描述 ：喂狗函数
**输入参数 ：无
**输出参数 ：无
********************************************************************************************************/
void IWDT_ReloadCounter(void)
{  
    IWDT->KR = 0xAAAA;//喂狗
}





